private/signRequest.xml

<soap12:Envelope
    xmlns:cdx="http://www.exchangenetwork.net/wsdl/register/sign/1"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <cdx:Sign>
      <securityToken><%= securityToken %></securityToken>
      <activityId><%= activityId %></activityId>
      <signatureDocument>
        <Name></Name>
        <Format>BIN</Format>
        <Content><%= content %></Content>
      </signatureDocument>
    </cdx:Sign>
  </soap12:Body>
</soap12:Envelope>
